dhblyy_OF_study/overset_test/overset_sphereDrop/sphereDrop/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
#includeEtc "caseDicts/setConstraintTypes"
    oversetpatch
    {
        type            overset;
        value           uniform (0 0 0);
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
  
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    farFieldWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

     oversetPatch
    {
        type            overset;
        value           uniform (0 0 0);
    }
    sphere
    {
        type            zeroGradient;
    }
    
}


// ************************************************************************* //
