dhblyy_OF_study/overset_test/overset_sphereDrop/sphereDrop/0.orig/zoneID
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
     location    "0";
    object      zoneID;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

     oversetpatch
    {
        type            overset;
        value           uniform 1;
    }
     front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    farFieldWall
    {
        type            zeroGradient;
    }

    oversetPatch
    {
        type            overset;
        value           uniform 1;
    }
    sphere
    {
        type            zeroGradient;
    }
    
}

// ************************************************************************* //
