dhblyy_OF_study/overset_test/overset_sphereDrop/sphereDrop/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
//c0 = region0
    {
        name    c0;
        type    cellSet;
        action  new;
        source  regionToCell;
        insidePoints ((-0.5 0.9 0));
    }
//copy c0 to c1
    {
        name    c1;
        type    cellSet;
        action  new;
        source  cellToCell;
        sourceInfo
          {
            set c0;
          }
    }
//c1 = c_total - c0
    {
        name    c1;
        type    cellSet;
        action  invert;
    }
//add a new cellZone c1 
    {
        name    c1;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
          {
            set c1;
          }
    }

);

// ************************************************************************* //
